---
title: FaceArray
classe: Autodesk.Revit.DB.FaceArray
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# FaceArray

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `faceArray.IsEmpty` | Boolean |
| `Face Item { get; set; }` | `faceArray.Item` | Face |
| `Int32 Size { get; }` | `faceArray.Size` | Int32 |
| `Void Append(Face)` | `faceArray.Append(item)` | Void |
| `Void Clear()` | `faceArray.Clear()` | Void |
| `FaceArrayIterator ForwardIterator()` | `faceArray.ForwardIterator()` | FaceArrayIterator |
| `IEnumerator GetEnumerator()` | `faceArray.GetEnumerator()` | IEnumerator |
| `Void Insert(Face, Int32)` | `faceArray.Insert(item, index)` | Void |
| `FaceArrayIterator ReverseIterator()` | `faceArray.ReverseIterator()` | FaceArrayIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```